from userbot.Config import Config # Ok
# for update code when i need it
HEROKU_APP_NAME = Config.HEROKU_APP_NAME or None
HEROKU_API_KEY = Config.HEROKU_API_KEY or None
UPSTREAM_REPO_BRANCH = Config.UPSTREAM_REPO_BRANCH
UPSTREAM_REPO = "https://github.com/Odysho/November-USERBOT"
T = Config.COMMAND_HAND_LER

Up_1 = "** ⪼ يوجـد تحـديث جديد لسورس نوفمبر ༗.**\n`{}`\n𓍹ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ𓍻\n[ՏøuƦcε πøνεʍβεƦ 🌦](tm.e/nneee)𓆪"
Up_2 = "**تنصيب تحديث بوت نوفمبر قيد التقدم ، يرجى الانتظار حتى تنتهي العملية ، وعادة ما يستغرق التحديث من 4 إلى 5 دقائق.**"
Up_3 = "**⪼ تم التحديث بنجاح ✅**\n ** جارٍ إعادة تشغيل بوت نوفمبر ، انتظر 𓆰.**"
Up_4 = "**⪼ جاري البحث عن التحديثات  🌐.. 𓆰،**"
Up_5 = "**⪼ يتم تنصيب التحديث  انتظر 🌐 𓆰،**"
Up_6 = "**⪼ يتم تحديث بوت نوفمبر انتظر 🌐..𓆰،**"

Upeor_1 = "بيانات اعتماد هيروكو غير صالحة لتنصيب اكسس"
Upeor_2 = "`عفوًا .. لا يمكن لبرنامج التحديث المتابعة بسبب "
Upeor_3 = "حدثت بعض المشاكل`\n\n**تتبع السجل:**\n"
Upeor_4 = "** ⪼ اضبط المتغيرات المطلوبة أولاً لتحديث بوت نوفمبر 𓆰،**",

Upend = "**⪼ سورس نوفمبر محدث لأخر اصدار ༗. **"
UpMsg =  f"⪼ اضغط هنا **للتحديث السريع ↫ **[`{T}تحديث الان`] او اضغط هنا **لتنصيب التحديث** وقد يستغرق 5 دقائق ↫ [`{T}تحديث البوت`]"
